package com.jkys.zyyh.mic.common.util;

import java.util.Calendar;

/**
 * <Description> <br>
 * 身份证号工具类
 * @author Rocky<br>
 * @version 1.0<br>
 * @createDate 2019/11/01 10:48 上午 <br>
 */
public class IdCardUtil {
    private IdCardUtil() {
    }

    /** 中国公民身份证号码最小长度。 */
    public static final int CHINA_ID_MIN_LENGTH = 15;

    /** 中国公民身份证号码最大长度。 */
    public static final int CHINA_ID_MAX_LENGTH = 18;

    private static final String AREA_CODE = "北京,1100;天津,1200;石家庄,1301;唐山市,1302;秦皇岛,1303;邯郸,1304;邢台,1305;保定,1306;张家口,1307;承德,1308;沧州,1309;廊坊,1310;衡水,1311;太原,1401;大同,1402;阳泉,1403;长治,1404;晋城,1405;朔州,1406;晋中,1407;运城,1408;忻州,1409;临汾,1410;吕梁,1411;呼和浩特,1501;包头市,1502;乌海市,1503;赤峰市,1504;通辽市,1505;鄂尔多斯,1506;呼伦贝尔,1507;巴彦淖尔,1508;乌兰察布,1509;兴安盟,1522;锡林郭勒盟,1525;阿拉善盟,1529;沈阳,2101;大连,2102;鞍山,2103;抚顺,2104;本溪,2105;丹东,2106;锦州,2107;营口,2108;阜新,2109;辽阳,2110;盘锦,2111;铁岭,2112;朝阳,2113;葫芦岛,2114;长春市,2201;吉林市,2202;四平市,2203;辽源市,2204;通化市,2205;白山市,2206;松原市,2207;白城市,2208;延边州,2224;哈尔滨,2301;齐齐哈尔,2302;鸡西,2303;鹤岗,2304;双鸭山,2305;大庆,2306;伊春,2307;佳木斯,2308;七台河,2309;牡丹江,2310;黑河,2311;绥化,2312;大兴安岭,2327;上海,3100;南京,3201;无锡,3202;徐州,3203;常州,3204;苏州,3205;南通,3206;连云港,3207;淮安,3208;盐城,3209;扬州,3210;泰州,3212;宿迁,3213;杭州,3301;宁波,3302;温州,3303;嘉兴,3304;湖州,3305;绍兴,3306;金华,3307;衢州,3308;舟山,3309;台州,3310;丽水,3311;合肥市,3401;芜湖市,3402;蚌埠市,3403;淮南市,3404;马鞍山,3405;淮北市,3406;铜陵市,3407;安庆市,3408;黄山市,3410;滁州市,3411;阜阳市,3412;宿州市,3413;六安市,3415;亳州市,3416;池州市,3417;宣城市,3418;福州,3501;厦门,3502;莆田,3503;三明,3504;泉州,3505;漳州,3506;南平,3507;龙岩,3508;宁德,3509;南昌,3601;景德镇,3602;萍乡,3603;九江,3604;新余,3605;鹰潭,3606;赣州,3607;吉安,3608;宜春,3609;抚州,3610;上饶,3611;济南,3701;青岛,3702;淄博,3703;枣庄,3704;东营,3705;烟台,3706;潍坊,3707;济宁,3708;泰安,3709;威海,3710;日照,3711;莱芜,3712;临沂,3713;德州,3714;聊城,3715;滨州,3716;菏泽,3717;郑州,4101;开封,4102;洛阳,4103;平顶山,4104;安阳,4105;鹤壁,4106;新乡,4107;焦作,4108;濮阳,4109;许昌市,4110;漯河,4111;三门峡,4112;南阳,4113;商丘,4114;信阳,4115;周口,4116;驻马店,4117;湖北,4200;武汉市,4201;黄石市,4202;十堰市,4203;宜昌市,4205;襄阳市,4206;鄂州市,4207;荆门市,4208;孝感市,4209;荆州市,4210;黄冈市,4211;咸宁市,4212;随州市,4213;恩施州,4228;长沙,4301;株洲,4302;湘潭,4303;衡阳,4304;邵阳,4305;岳阳,4306;常德,4307;张家界,4308;益阳,4309;郴州,4310;永州,4311;怀化,4312;娄底,4313;湘西州,4331;广州市,4401;韶关市,4402;深圳市,4403;珠海市,4404;汕头市,4405;佛山市,4406;江门市,4407;湛江市,4408;茂名市,4409;肇庆市,4412;惠州市,4413;梅州市,4414;汕尾市,4415;河源市,4416;阳江市,4417;清远市,4418;东莞市,4419;中山市,4420;潮州市,4451;揭阳市,4452;云浮市,4453;南宁,4501;柳州,4502;桂林,4503;梧州,4504;北海,4505;防城港,4506;钦州,4507;贵港,4508;玉林,4509;百色,4510;贺州,4511;河池,4512;来宾,4513;崇左,4514;海口市,4601;三亚市,4602;重庆,5000;成都,5101;自贡,5103;攀枝花,5104;泸州,5105;德阳,5106;绵阳,5107;广元,5108;遂宁,5109;内江,5110;乐山,5111;南充,5113;眉山,5114;宜宾,5115;广安,5116;达州,5117;雅安,5118;巴中,5119;资阳,5120;阿坝,5132;甘孜,5133;凉山州,5134;贵州,5200;贵阳,5201;六盘水,5202;遵义,5203;安顺,5204;毕节市,5205;铜仁市,5206;黔西南州,5223;黔东南州,5226;黔南州,5227;昆明,5301;曲靖,5303;玉溪,5304;保山,5305;昭通,5306;丽江,5307;普洱,5308;临沧,5309;楚雄州,5323;红河州,5325;文山州,5326;西双版纳州,5328;大理州,5329;德宏州,5331;怒江州,5333;迪庆州,5334;拉萨,5401;昌都市,5421;山南,5422;日喀则市,5423;那曲,5424;阿里,5425;林芝,5426;西安市,6101;铜川市,6102;宝鸡市,6103;咸阳市,6104;渭南市,6105;延安市,6106;汉中市,6107;榆林市,6108;安康市,6109;商洛市,6110;兰州,6201;嘉峪关,6202;金昌,6203;白银,6204;天水,6205;武威,6206;张掖,6207;平凉,6208;酒泉,6209;庆阳,6210;定西,6211;陇南,6212;临夏州,6229;甘南州,6230;西宁市,6301;海东市,6321;海北州,6322;黄南州,6323;海南州,6325;果洛州,6326;玉树州,6327;海西州,6328;银川市,6401;石嘴山市,6402;吴忠市,6403;固原市,6404;中卫市,6405;乌鲁木齐市,6501;克拉玛依市,6502;吐鲁番市,6521;哈密地区,6522;昌吉州,6523;博尔塔拉州,6527;巴音郭楞州,6528;阿克苏地区,6529;克孜勒苏州,6530;喀什地区,6531;和田地区,6532;霍尔果斯市,6540;伊犁州,6540;塔城地区,6542;阿勒泰地区,6543;台湾,7100";

    /**
     * 根据身份编号获取年龄
     *
     * @param idCard
     *            身份编号
     * @return 年龄
     */
    public static int getAgeByIdCard(String idCard) {
        int iAge;
        Calendar cal = Calendar.getInstance();
        int iCurrYear = cal.get(Calendar.YEAR);
        if (idCard.length() == CHINA_ID_MIN_LENGTH) {
            iAge = iCurrYear - Integer.parseInt("19" + idCard.substring(6, 8));
        } else {
            iAge = iCurrYear - Integer.valueOf(idCard.substring(6, 10));
        }
        return iAge;
    }

    /**
     * 根据身份编号获取性别
     *
     * @param idCard 身份编号
     * @return 性别(0-女，1-男，-1-未知)
     */
    public static Integer getGenderByIdCard(String idCard) {
        Integer sGender;

        if (idCard.length() == CHINA_ID_MIN_LENGTH) {
            sGender = (Integer.parseInt(idCard.substring(14, 15)) % 2 != 0) ? 1 : 0;
        } else {
            sGender = (Integer.parseInt(idCard.substring(16, 17)) % 2 != 0) ? 1 : 0;
        }
        return sGender;
    }

    /**
     * 根据身份编号获取地区
     *
     * @param idCard 身份编号
     * @return
     */
    public static String getAreaByIdCard(String idCard) {
        String code = idCard.substring(0, 4);
        String[] areaList = AREA_CODE.split(";");
        for (int i = 0; i < areaList.length; i++) {
            if (areaList[i].contains(code)) {
                return areaList[i].split(",")[0];
            }
        }
        return "中国";
    }
}
